{
  "backend/main.mo": "Motoko actor defining Restaurant type with fields (name, cuisine, price, rating, address, hours, menu) and functions to add restaurants and query them by cuisine, price range, or minimum rating.",
  "feature_evidence.json": "Feature evidence report mapping five main features (listing page, search, filters, detail view, visual theme) to their implementing files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of 14 frontend files covering styling, routing, components, hooks, and pages for the restaurant discovery application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, food-focused color palette using OKLCH color space for both light and dark modes.",
  "frontend/index.html": "HTML entry point with root div and module script loading the React application with title 'Quick Resto'.",
  "frontend/src/App.tsx": "TanStack Router setup defining root, index (listing), and detail routes wrapped in Layout component with TypeScript module augmentation for router typing.",
  "frontend/src/components/FilterControls.tsx": "Filter controls component with three Select dropdowns (cuisine, price, rating) and a clear filters button that appears when any filter is active.",
  "frontend/src/components/Layout.tsx": "Application layout with sticky header containing Quick Resto branding and navigation, main content outlet, and footer with caffeine.ai attribution link.",
  "frontend/src/components/RestaurantCard.tsx": "Clickable restaurant card component displaying image, name, cuisine badge, star rating, price indicator, and address with hover effects and navigation to detail page.",
  "frontend/src/components/RestaurantGrid.tsx": "Responsive grid layout rendering restaurant cards in 1-3 columns with empty state message when no restaurants match filters.",
  "frontend/src/components/SearchBar.tsx": "Search input component with search icon, placeholder text, and clear button that appears when text is entered.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, returning actor instance and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all restaurants and adding new restaurants, using the backend actor and managing cache invalidation.",
  "frontend/src/hooks/useRestaurantFilters.ts": "Custom hook that filters restaurants by cuisine type, price range, and minimum rating, providing filter state management and reset functionality.",
  "frontend/src/hooks/useRestaurantSearch.ts": "Custom hook that filters restaurants by name based on a search query string, returning memoized results.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, food-themed color palette using OKLCH color space for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Displays detailed information for a single restaurant including hero image, rating, address, hours, and menu highlights, with navigation back to the listing page.",
  "frontend/src/pages/RestaurantListingPage.tsx": "Main page displaying a searchable and filterable grid of restaurants with hero section, search bar, filter controls, and results count.",
  "frontend/src/utils/restaurantImages.ts": "Maps cuisine types to corresponding restaurant images, providing a helper function to retrieve the appropriate image URL for each restaurant.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container settings, animations, and design tokens for the restaurant app.",
  "project_state.json": "Project state file for Quick Resto restaurant finder app tracking architectural notes, existing features (restaurant listings, search, filters, detail views), and new feature requests. Includes image requirements for six restaurant types and defines the modern food-focused visual theme."
}