{
  "backend/main.mo": "Main actor implementing a food delivery platform with restaurant management, menu items, order placement, user profiles, and access control using mixins for authorization and blob storage.",
  "backend/migration.mo": "Migration module that transforms old restaurant data structure (without menuItems) to new structure (with menuItems array) and initializes orders and order ID counter.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: shopping cart state management, order menu display, cart review page, checkout flow, and order history page with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including styling, routing, components, hooks, and pages for the Quick Resto food delivery application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Quick Resto application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for restaurant listing, detail, cart, checkout, order confirmation, and order history pages wrapped in Layout component.",
  "frontend/src/components/CartButton.tsx": "Floating cart button component displaying shopping cart icon with badge showing total item count, navigating to cart page on click.",
  "frontend/src/components/CartItemRow.tsx": "Cart item row component displaying restaurant name, item details, price, quantity controls with plus/minus buttons, line total, and remove button.",
  "frontend/src/components/CheckoutForm.tsx": "A form component for checkout that collects delivery address, phone number, and optional notes with validation. Displays loading state during submission and shows validation errors inline.",
  "frontend/src/components/FilterControls.tsx": "Provides filter dropdowns for cuisine type, price range, and minimum rating with a clear filters button. Displays active filter state and allows resetting all filters.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo, navigation links (Browse, Order History), cart button, and footer with branding. Uses TanStack Router for navigation and wraps page content with Outlet.",
  "frontend/src/components/MenuItemCard.tsx": "Displays a single menu item with name, description, price, and an add-to-cart button. Shows temporary \"Added\" confirmation feedback when item is added.",
  "frontend/src/components/OrderHistoryCard.tsx": "Expandable card showing order details including order ID, restaurant, timestamp, status badge, total amount, and collapsible section with items and delivery info. Formats order status with color-coded badges.",
  "frontend/src/components/OrderMenu.tsx": "Fetches and displays restaurant menu items grouped by category with loading and empty states. Integrates with cart context to add items.",
  "frontend/src/components/OrderSummary.tsx": "Displays cart contents grouped by restaurant with item quantities, prices, and total amount. Shows itemized breakdown of the current order.",
  "frontend/src/components/RestaurantCard.tsx": "Clickable card displaying restaurant info including image, name, cuisine type, price range, rating stars, and address. Navigates to restaurant detail page on click with hover effects.",
  "frontend/src/components/RestaurantGrid.tsx": "Grid layout component that renders a list of RestaurantCard components in a responsive grid. Shows empty state message when no restaurants match filters.",
  "frontend/src/components/SearchBar.tsx": "Search input with magnifying glass icon and clear button. Controlled component that accepts value and onChange callback for filtering restaurants by name.",
  "frontend/src/contexts/CartContext.tsx": "React context provider for shopping cart state management with sessionStorage persistence, supporting add/remove/update operations and total calculations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, handling authentication state changes and initializing access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow and identity state with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including restaurants, menu items, orders, and user profiles with automatic cache invalidation.",
  "frontend/src/hooks/useRestaurantFilters.ts": "Custom hook providing restaurant filtering logic by cuisine type, price range, and minimum rating with memoized results.",
  "frontend/src/hooks/useRestaurantSearch.ts": "Custom hook that filters restaurants by search query with case-insensitive name matching and memoization.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, food-themed color palette for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page component displaying grouped cart items by restaurant with quantity controls, order summary, and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page component that handles order placement, requiring user authentication and validating that all cart items are from the same restaurant. Displays a checkout form with delivery address, phone, and notes fields, and navigates to order confirmation upon successful order placement.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that displays success message and order details (ID and status) after checkout. Provides navigation buttons to view order history or return home.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Order history page that displays a user's past orders sorted by timestamp (newest first), requiring authentication. Shows empty state with call-to-action if no orders exist.",
  "frontend/src/pages/RestaurantDetailPage.tsx": "Restaurant detail page showing hero image, restaurant information (name, cuisine, price range, rating, location, hours), and an order menu component. Fetches restaurant data by name from URL params.",
  "frontend/src/pages/RestaurantListingPage.tsx": "Main restaurant listing page with search bar, filter controls (cuisine, price, rating), and restaurant grid display. Shows filtered results count and handles loading/error states.",
  "frontend/src/types/cart.ts": "TypeScript type definitions for cart functionality including CartItem, CartState, and CartOperations interfaces defining the structure and operations for shopping cart management.",
  "frontend/src/utils/restaurantImages.ts": "Utility function that maps restaurant cuisine types to corresponding image assets, with Italian as the default fallback image.",
  "frontend/src/utils/urlParams.ts": "URL parameter utility functions for extracting, storing, and managing URL parameters in both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color palette using OKLCH color space, typography settings with Inter and Playfair Display fonts, custom shadows, border radius variables, and accordion animations with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking Quick Resto restaurant finder app with version 5, documenting existing features including restaurant listings, search/filter functionality, detail views, shopping cart system, and order placement capabilities."
}